Repository: arixbit/Arbor
Catalog: Arbor/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Synchronize hosted protected branch rules after fetch
zh_hans: Fetch 后同步托管平台受保护分支规则

source: System Default
zh_hans: 跟随系统

source: Tag deleted
zh_hans: 标签已删除

source: Tag name
zh_hans: Tag 名称

source: Tag restored
zh_hans: 标签已恢复

source: tag 名称
zh_hans: 标签名称

source: Tags
zh_hans: 标签

source: Tags deleted
zh_hans: 标签已删除

source: Target branch
zh_hans: 目标分支

source: Target branch is required
zh_hans: 必须填写目标分支

source: Target Changelist
zh_hans: 目标 Changelist

source: Target: %@
zh_hans: 目标：%@

source: Template
zh_hans: 模板

source: Test Connection
zh_hans: 测试连接

source: Test Git executable
zh_hans: 测试 Git 可执行文件

source: Text
zh_hans: 文本

source: Text Filter Settings
zh_hans: 文本过滤设置

source: The branch %@ was deleted from the selected repositories.
zh_hans: 分支 %@ 已从所选仓库删除。

source: The branch reference was removed, but its old tip is still available to restore.
zh_hans: 分支引用已移除，但旧 tip 仍可用于恢复。

source: The connection was blocked because the remote SSH host key changed. Verify the server identity, review Known Hosts in Git SSH Settings, then retry.
zh_hans: 连接已阻止，因为远端 SSH host key 已变化。请确认服务器身份，检查 Git SSH 设置中的 Known Hosts 后重试。

source: The diagnostic list includes repository and user helpers. Available means the executable is present; actual credential success is confirmed only by a successful Git operation.
zh_hans: 诊断列表包含仓库级和用户级凭证助手。“可用”只表示可执行文件存在；实际凭证成功只能通过成功完成一次 Git 操作确认。

source: The diagnostic list includes repository and user helpers. Transport continues to use the system Git credential flow.
zh_hans: 诊断列表包含仓库级和用户级凭证助手；传输仍使用系统 Git 凭证流程。

source: The file will return to the unresolved conflict list.
zh_hans: 该文件将返回未解决冲突列表。

source: The gitlink ids are equal, or the nested objects are not available locally.
zh_hans: gitlink ID 相同，或本地无法获取嵌套对象。

source: The initial commit has no parent. Continue with this history rewrite?
zh_hans: 初始提交没有父提交。是否继续改写这段历史？

source: The linear todo editor does not yet support rebasing from a merge commit.
zh_hans: 当前线性 todo 编辑器暂不支持从 merge 提交开始 Rebase。

source: The linear todo editor does not yet support rebasing from the root commit.
zh_hans: 当前线性 todo 编辑器暂不支持从根提交开始 Rebase。

source: The new name must be different.
zh_hans: 新名称必须不同。

source: The original repository is no longer active.
zh_hans: 原始仓库已不再处于活动状态。

source: The saved report is no longer available.
zh_hans: 保存的报告已不可用。

source: The selected remote has no matching tags.
zh_hans: 选中的远程没有匹配的 Tag。

source: The selected root is not an ancestor of the current branch.
zh_hans: 所选根提交不是当前分支的祖先

source: The shelf was kept. Resolve any local conflict, then try the member again.
zh_hans: Shelf 已保留。解决本地冲突后重试该成员。

source: The shelf was kept. Resolve the conflict or retry rollback.
zh_hans: Shelf 已保留。解决冲突或重试回滚。

source: The shelf was kept. Resolve the local conflict, then retry.
zh_hans: Shelf 已保留。解决本地冲突后重试。

source: The source can be a detached commit; choose the remote target branch below.
zh_hans: 源可以是 detached 提交；请在下方选择远程目标分支。

source: The tag reference was removed, but its saved target is still available to restore.
zh_hans: 标签引用已删除，但保存的目标仍可恢复。

source: The value may include SSH options, such as -i, -F, or -o.
zh_hans: 该值可以包含 SSH 选项，例如 -i、-F 或 -o。

source: There are no failed Checkout and Update roots to retry.
zh_hans: 没有可重试的 Checkout and Update 失败仓库。

source: There is no failed Checkout and Update root to retry.
zh_hans: 没有可重试的 Checkout and Update 失败仓库。

source: These are repository-local overrides. Empty fields remove the local override and let system or global Git configuration apply.
zh_hans: 这些是仓库级本地覆盖配置。留空会移除本地覆盖，并使用系统或全局 Git 配置。

source: This applies only to a non-current local source branch that is not protected. Remote branches, protected branches, and revision-only merges are kept.
zh_hans: 此设置仅适用于未保护的非当前本地源分支。远程分支、受保护分支和仅指定修订版本的合并都会保留。

source: This commit has no parent. File names and content diff are unavailable in this version.
zh_hans: 该提交没有父提交，此版本暂不提供文件名和内容 diff。

source: This deletes the branch from the remote repository in every selected root.
zh_hans: 这会在每个选中的 root 中从远程仓库删除此分支。

source: This file cannot be merged in the text editor. Choose which complete version to keep.
zh_hans: 此文件无法在文本编辑器中合并，请选择要保留的完整版本。

source: This file is resolved in the current Git operation. Revert the resolution to reopen the three-way conflict editor.
zh_hans: 该文件已在当前 Git 操作中解决。撤销解决后可重新打开三方冲突编辑器。

source: This permanently removes every local stash from this repository.
zh_hans: 这会永久删除此仓库中的所有本地 Stash。

source: This project inherits the global protected branch patterns and synchronization setting.
zh_hans: 此项目继承全局受保护分支正则与同步设置。

source: This removes the local tag in every selected root; its exact target remains available to restore.
zh_hans: 这会在每个选中的 root 中删除本地标签；其精确目标仍可用于恢复。

source: This removes the remote configuration and its remote-tracking branches.
zh_hans: 这会移除远程配置及其远程跟踪分支。

source: This setting applies only to this project. Use the global setting to inherit the app-wide Git preference.
zh_hans: 此设置仅适用于当前项目。选择全局设置可继承应用级 Git 偏好。

source: Title
zh_hans: 标题

source: Toggle Log Columns
zh_hans: 切换日志列

source: Token cleared
zh_hans: Token 已清除

source: Token is configured
zh_hans: Token 已配置

source: Tokens are stored in macOS Keychain and never passed to the git engine.
zh_hans: Token 仅存储在 macOS Keychain 中，不会传入 git 引擎。

source: Truncated
zh_hans: 已截断

source: Unable to load changed files
zh_hans: 无法加载变更文件

source: Unable to load diff
zh_hans: 无法加载 Diff

source: Unable to load signature status
zh_hans: 无法加载签名状态

source: Unable to load Submodule Changes
zh_hans: 无法加载子模块变化

source: Unavailable
zh_hans: 不可用

source: Undo
zh_hans: 撤销

source: Undo Latest Commit…
zh_hans: 撤销最近一次提交…

source: Undo Rebase
zh_hans: 撤销 Rebase

source: Undo shelf deletion
zh_hans: 撤销 Shelf 删除

source: Undo shelf deletion failed
zh_hans: 撤销 Shelf 删除失败

source: Unified
zh_hans: 统一 diff

source: Unknown
zh_hans: 未知

source: unmerged
zh_hans: 未合并

source: Unmerged branches are force-deleted like IntelliJ's multi-repository operation; their exact tips remain available for restore.
zh_hans: 未合并分支将按 IntelliJ 多仓库操作强制删除；其精确 tip 仍可用于恢复。

source: Unmerged commits
zh_hans: 未合并提交

source: unset
zh_hans: 已取消设置

source: Unset Upstream
zh_hans: 取消 upstream

source: Unset upstream after rename
zh_hans: 重命名后解除 upstream

source: Unshelve
zh_hans: 恢复 Shelf

source: Unshelve Changes
zh_hans: 恢复变更

source: Unshelve Changes and Remove
zh_hans: 恢复变更并移除

source: Unshelve completed
zh_hans: Unshelve 已完成

source: Unshelve Multiple Shelves
zh_hans: 恢复多个 Shelf

source: Unshelve paused
zh_hans: Unshelve 已暂停

source: Unshelve Selected
zh_hans: 恢复所选成员

source: Unshelve Selected Changes
zh_hans: 恢复选中的变更

source: Unshelve Selected Changes and Remove
zh_hans: 恢复选中的变更并移除

source: Unshelve selected changes failed
zh_hans: 恢复所选变更失败

source: Unshelve selected shelves
zh_hans: 恢复选中的 Shelf

source: Unshelve Selected Shelves
zh_hans: 恢复选中的 Shelf

source: Unshelve selected shelves failed
zh_hans: 恢复选中的 Shelf 失败

source: Unshelve selected shelves paused
zh_hans: 恢复选中的 Shelf 已暂停

source: Unshelve shelves silently
zh_hans: 静默恢复 Shelf

source: Unshelve shelves silently failed
zh_hans: 静默恢复 Shelf 失败

source: Unshelve shelves silently paused
zh_hans: 静默恢复 Shelf 已暂停

source: Unshelve Silently
zh_hans: 静默恢复

source: unspecified
zh_hans: 未指定

source: Unstage
zh_hans: 取消暂存

source: Unstage All
zh_hans: 取消暂存全部

source: Unstage this file
zh_hans: 取消暂存此文件

source: Unstaged Files
zh_hans: 未暂存文件

source: Until
zh_hans: 截止日期

source: Unverified signature
zh_hans: 未验证签名

source: Unversioned Files
zh_hans: 未纳入版本控制的文件

source: Up
zh_hans: 上一级

source: Update Force-Pushed Branch in Repositories…
zh_hans: 在多个仓库更新被强制推送的分支…

source: Update Force-Pushed Branch…
zh_hans: 更新被强制推送的分支…

source: Update Project
zh_hans: 更新项目

source: Update refs
zh_hans: 更新 refs

source: Update stash pending
zh_hans: Update 暂存待恢复

source: Update this Git root, resolve any conflicts, then retry Push.
zh_hans: 更新此 Git 仓库，解决冲突后重试 Push。

source: Update with Merge
zh_hans: 使用 Merge 更新

source: Upstream tracking branch is missing
zh_hans: upstream 跟踪分支缺失

source: Use force-with-lease (safer)
zh_hans: 使用 force-with-lease（更安全）

source: Use force-with-lease by default
zh_hans: 默认使用 force-with-lease

source: Use Git credential helper
zh_hans: 使用 Git 凭证助手

source: Use project-specific Git executable
zh_hans: 使用项目专属的 Git 可执行文件

source: Use project-specific protected branch rules
zh_hans: 使用项目专属的受保护分支规则

source: Used before Pull, Update Project, Rebase, and smart checkout operations. An interrupted restore remains recoverable after restart.
zh_hans: 用于 Pull、Update Project、Rebase 和智能 Checkout 之前。中断的恢复流程可在重启后继续恢复。

source: Verified signature
zh_hans: 已验证签名

source: Version
zh_hans: 版本

source: View Changes
zh_hans: 查看变更

source: View Commit Details
zh_hans: 查看提交详情

source: View Commits
zh_hans: 查看提交

source: View saved changes…
zh_hans: 查看已保存的变更…

source: Waiting…
zh_hans: 等待中…

source: When disabled, remote operations use Arbor's credential dialog instead of configured Git credential helpers.
zh_hans: 关闭后，远程操作会使用 Arbor 的凭证对话框，而不是已配置的 Git 凭证助手。

source: When disabled, this project inherits the global protected branch settings.
zh_hans: 关闭后，此项目继承全局受保护分支设置。

source: When enabled, an Unshelve without an explicit target creates or reuses a Changelist named after the Shelf description. IntelliJ keeps this option off by default.
zh_hans: 启用后，没有明确目标的 Unshelve 会按 Shelf 描述创建或复用同名变更列表。IntelliJ 默认关闭此选项。

source: When force push is selected, protect against overwriting a remote update unless you explicitly turn lease off in the Push dialog.
zh_hans: 选择强制推送时，默认防止覆盖远程更新；如需关闭 lease，请在 Push 对话框中明确取消。

source: Wider
zh_hans: 加宽

source: Word Diff
zh_hans: 词级差异

source: Working-tree encoding
zh_hans: 工作区编码

source: Working…
zh_hans: 正在处理…

source: Worktree
zh_hans: 工作区

# 二进制文件，无法显示 diff
source: Binary file, diff unavailable
zh_hans: 二进制文件，无法显示 diff

source: 从此提交建分支
zh_hans: 从此提交创建分支

source: 冲突文件已进入 Merge Revisions
zh_hans: 冲突文件已进入合并版本

# 分支
source: Branch
zh_hans: 分支

# 分支 / stash / 合并操作在左侧完成
source: Branch / stash / merge operations in the sidebar
zh_hans: 分支 / stash / 合并操作在左侧完成

# 变基
source: Rebase
zh_hans: 变基

# 合并
source: Merge
zh_hans: 合并

source: 在浏览器打开
zh_hans: 在浏览器中打开

# 工作区
source: Worktree
zh_hans: 工作区

# 已暂停在 edit 提交（可改文件）
source: Paused at edit commit (modify files)
zh_hans: 已暂停在 edit 提交（可改文件）

# 已暂存
source: Staged
zh_hans: 已暂存

# 当前
source: current
zh_hans: 当前

source: 打开 Merge Revisions…
zh_hans: 打开合并版本…

# 无冲突块
source: No conflict blocks
zh_hans: 无冲突块

# 日志
source: Log
zh_hans: 日志

# 状态
source: Status
zh_hans: 状态

# 该维度无变更
source: No changes in this dimension
zh_hans: 该维度无变更

# 远程
source: Remote
zh_hans: 远程

# 选择一个提交查看详情
source: Select a commit for details
zh_hans: 选择一个提交查看详情

# 选择一个文件查看 diff / 冲突
source: Select a file to view diff / conflict
zh_hans: 选择一个文件查看 diff / 冲突
